### Import modules

In [1]:
import pandas as pd 
import numpy as np 

print(pd.__version__)
print(np.__version__)

1.3.4
1.20.3

### Persiapan Data Frame

In [4]:
n_rows = 5
n_cols = 5 
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1,10,size=(n_rows,n_cols)),
                 columns=cols)
df

   A  B  C  D  E
0  6  4  1  9  2
1  8  4  5  1  6
2  9  7  4  2  6
3  5  7  6  6  1
4  5  4  2  7  9

### Mengganti nama (label) untuk sebuah kolom pada Data Frame

In [5]:
df.rename(columns={'C' : 'Hobi'})

   A  B  Hobi  D  E
0  6  4     1  9  2
1  8  4     5  1  6
2  9  7     4  2  6
3  5  7     6  6  1
4  5  4     2  7  9

In [6]:
df.rename(columns={'A' : 'Nama', 'B' : 'Alamat' , 'D' : 'Kota'})

   Nama  Alamat  C  Kota  E
0     6       4  1     9  2
1     8       4  5     1  6
2     9       7  4     2  6
3     5       7  6     6  1
4     5       4  2     7  9